rottenpotatoes/app/controllers/movies_controller.rb

  def similar_movies
    # debugger
    @movie = Movie.find params[:movie_id]
    if @movie.director && @movie.director != ""
      @similar_movies = Movie.where(:director => @movie.director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]