hw4/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
---
  def similar_movies
    # debugger
    @movie = Movie.find params[:movie_id]